[
  {
    "name": "Back Step",
    "icon": "Skill BackStep.png",
    "description": "Quickly retreat a short distance, can be used in air",
    "cooldown": "10s",
    "class": "ranger"
  },
  {
    "name": "Field Ration",
    "icon": "Skill Field Ration.png",
    "description": "Forage food and recover 25 HP. This counts as Physical Healing. (3 stacks, non replenishable.)",
    "cooldown": "24s",
    "class": "ranger"
  },
  {
    "name": "Forceful Shot",
    "icon": "Skill Forceful Shot.png",
    "description": "For 8 seconds after activation, hitting an enemy with a ranged attack knocks them back.",
    "cooldown": "18s",
    "class": "ranger"
  },
  {
    "name": "Multishot",
    "icon": "Skill Multishot.png",
    "description": "When attacking with a bow-type weapon, fire 5 arrows at a horizontal angle at the same time. Damages for the five arrows are 50%, 75%, 100%, 75%, 50%, respectively. Total of 350% damage if all arrows hit the target.",
    "cooldown": "22s",
    "class": "ranger"
  },
  {
    "name": "Penetrating Shot",
    "icon": "Skill Penetrating Shot.png",
    "description": "For 8 seconds, reduces the effectiveness of enemy Headshot Damage Reduction by -50% and grants an additional +25% Armor Penetration. Not limited to ranged weaponry.",
    "cooldown": "18s",
    "class": "ranger"
  },
  {
    "name": "Quick Fire",
    "icon": "Skill Quick Fire.png",
    "description": "When attacking using a bow-type weapon, grants additional flat +50% Action Speed for 8 seconds.",
    "cooldown": "18s",
    "class": "ranger"
  },
  {
    "name": "Quickshot",
    "icon": "Skill Quickshot.png",
    "description": "Hold multiple arrows in your shooting hand and fire them quickly in succession in a single action. Longbow: 2 arrows, Recurve Bow: 3 arrows, Survival Bow: 4 arrows",
    "cooldown": "22s",
    "class": "ranger"
  },
  {
    "name": "True Shot",
    "icon": "Skill True Shot.png",
    "description": "Projectile's flight speed is no longer affected by gravity but is still affected by Damage Falloff for 8 seconds (works with thrown weapons). In addition, Physical Power Bonus is increased by +8%.",
    "cooldown": "18s",
    "class": "ranger"
  },
  {
    "name": "Caltrops",
    "icon": "Skill Caltrops.png",
    "description": "Places caltrops on the ground behind the user. If stepped on, the caltrops deal 10 Physical Damage and will decrease the victim's Move Speed Bonus by -50% for 3 seconds. (4 uses, non-replenishable.)",
    "cooldown": "12s",
    "class": "rogue"
  },
  {
    "name": "Cut Throat",
    "icon": "Skill Cut Throat.png",
    "description": "If the next attack is successful, it cancels all of the target's current animations and channels of casting Spells/Skills/Songs, refunding the cast to the target and applying a Silence debuff to the victim for 4 seconds. Silence prevents the further use of Spells/Skills/Songs. Additionally, Cut Throat removes all Skill-sourced buffs that apply an effect on-hit, like Blow of Corruption, Smite, other Cut-Throats, Blood Exchange, etc. It also purges some other specific buffs, which do not fit the previously mentioned criteria.",
    "cooldown": "18s",
    "class": "rogue"
  },
  {
    "name": "Hide",
    "icon": "Skill Hide.png",
    "description": "Become invisible for 20 seconds. It is possible to change your equipment in this state. You are revealed when you attempt an action, such as moving, attacking, or using a skill. (As Hide is a buff, its duration is affected by Starter Rogue's -30% buff duration)",
    "cooldown": "40s",
    "class": "rogue"
  },
  {
    "name": "Rupture",
    "icon": "Skill Rupture.png",
    "description": "The next successful attack causes the target to bleed for 20 Physical Damage over 5 seconds as Damage over Time. The buff is consumed when attack hits an object or target.",
    "cooldown": "18s",
    "class": "rogue"
  },
  {
    "name": "Smoke Pot",
    "icon": "Skill Smoke Bomb.png",
    "description": "A smoke grenade is deployed creating a smoke screen. The smoke screen lasts 12 seconds and covers a 7.5m area. When a hostile target enters the smoke screen, their Move Speed Bonus is decreased by -10%. Has only 3 charges.",
    "cooldown": "24s",
    "class": "rogue"
  },
  {
    "name": "Tumbling",
    "icon": "Skill Tumbling.png",
    "description": "When used, backtumbles in the opposite direction the player is facing.",
    "cooldown": "/",
    "class": "rogue"
  },
  {
    "name": "Weakpoint Attack",
    "icon": "Skill Weakpoint Attack.png",
    "description": "Applies debuff on the next hit that decreases target's Armor Rating by -30% for 3 seconds. This only affects Armor Rating given by gear's base stats. It will not impact Armor Rating given by buffs or by +Armor Rating enchantments.",
    "cooldown": "24s",
    "class": "rogue"
  },
  {
    "name": "Adrenaline Rush",
    "icon": "Skill Adrenaline Rush.png",
    "description": "Grants additional flat +15% Action Speed for 8 seconds. After the duration ends, your Action Speed is reduced by a flat -8% and your Move Speed Bonus is decreased by -4% for 2 seconds.",
    "cooldown": "28s",
    "class": "fighter"
  },
  {
    "name": "Breakthrough",
    "icon": "Skill Breakthrough.png",
    "description": "Removes debuffs that slow move speed and ignore all move speed debuff effects for 5 seconds.",
    "cooldown": "14s",
    "class": "fighter"
  },
  {
    "name": "Perfect Block",
    "icon": "Skill Perfect Block.png",
    "description": "The next blocked attack will not induce any stagger penalties for 6s.",
    "cooldown": "18s",
    "class": "fighter"
  },
  {
    "name": "Second Wind",
    "icon": "Skill Second Wind.png",
    "description": "Heals 40% of Max Health over 12 seconds. Additionally, it eliminates the side effects of the Adrenaline Rush skill. Single-use, rechargeable with campfires at the rate of a Tier 5 Spell. (Doesn't scale with physical or magical healing bonuses, but the duration is influenced by buff duration)",
    "cooldown": "/",
    "class": "fighter"
  },
  {
    "name": "Shield Slam",
    "icon": "Skill Shield Slam.png",
    "description": "When using a shield, perform a shield bash attack that actively blocks and deals 25 Physical Damage and decreases the victim's Move Speed Bonus by -20% for 2 seconds after knocking them backwards. 100% scaling",
    "cooldown": "16s",
    "class": "fighter"
  },
  {
    "name": "Sprint",
    "icon": "Skill Sprint.png",
    "description": "Gain +50 flat Move Speed for 6 seconds.",
    "cooldown": "28s",
    "class": "fighter"
  },
  {
    "name": "Taunt",
    "icon": "Skill Taunt.png",
    "description": "Increases the aggro value to all monsters within a 7.5m area by 50% and grants an additional flat +10% Physical and Magical Damage Reduction for 8 seconds.",
    "cooldown": "18s",
    "class": "fighter"
  },
  {
    "name": "Victory Strike",
    "icon": "Skill Victory Strike.png",
    "description": "Increases Physical Power Bonus by +20% for one attack. If the target dies from this attack you recover 5% of Max Health.",
    "cooldown": "24s",
    "class": "fighter"
  },
  {
    "name": "Achilles Strike",
    "icon": "Skill Achilles Strike.png",
    "description": "The next hit applies a debuff that lasts 2.5 seconds. During this debuff, the victim's Move Speed Bonus is decreased by -30%, and any step they take will inflict 1 Physical Damage. Initial Damage: 100%, Damage per step: 50%.",
    "cooldown": "24s",
    "class": "barbarian"
  },
  {
    "name": "Blood Exchange",
    "icon": "Skill Blood Exchange.png",
    "description": "Reduce Max Health Bonus by 20% for 8 seconds while gaining Lifesteal. Lifesteal: Successful attacks that deal Damage grant the player back 10% of Max Health. (Single use, rechargeable with campfires. Skill Tier 5.)",
    "cooldown": "28s",
    "class": "barbarian"
  },
  {
    "name": "War Sacrifice",
    "icon": "Skill Life Siphon.png",
    "description": "Upon activation gain +5 All Attributes for 8 seconds, but lose 10% of your maximum health as a sacrifice over the same duration.",
    "cooldown": "28s",
    "class": "barbarian"
  },
  {
    "name": "Rage",
    "icon": "Skill Rage.png",
    "description": "Strength and Vigor is increased by +10 and Movement Speed is increased multiplicatively by 12%, while Physical Damage Reduction is additively reduced by 25% for 6 seconds.",
    "cooldown": "28s",
    "class": "barbarian"
  },
  {
    "name": "Reckless Attack",
    "icon": "Skill Reckless Attack.png",
    "description": "The next hit has 85% armor penetration. Your aggressiveness results in a -200 armor rating. The buff is consumed when an attack hits an object or a target.",
    "cooldown": "24s",
    "class": "barbarian"
  },
  {
    "name": "Savage Roar",
    "icon": "Skill Savage Roar.png",
    "description": "Frightens all enemies within a 7.5m range radius, decreasing players Physical Power Bonus by -40% for 6 seconds and forcing monsters to walk away from you for 3 seconds.",
    "cooldown": "28s",
    "class": "barbarian"
  },
  {
    "name": "War Cry",
    "icon": "Skill War Cry.png",
    "description": "Grants +25% increased Max Health Bonus of self and allies within 7.5m for 7 seconds.",
    "cooldown": "24s",
    "class": "barbarian"
  },
  {
    "name": "Arcane Shield",
    "icon": "Skill Arcane Shield.png",
    "description": "Places a shield around you that absorbs 20 damage from all types for 15 seconds. Upon absorbing all the damage this shield can absorb, it unleashes an Arcane Explosion dealing 5 Magical Damage to targets within 2m. 50% Shield, 100% Blast.",
    "cooldown": "24s",
    "class": "wizard"
  },
  {
    "name": "Intense Focus",
    "icon": "Skill Intense Focus.png",
    "description": "Reduce the casting time of the next spell you cast to 0.1 seconds.",
    "cooldown": "18s",
    "class": "wizard"
  },
  {
    "name": "Meditation",
    "icon": "Skill Meditation.png",
    "description": "Enter a meditative state and restore Spells at a rate of 34 SP per 1.5 seconds over 24 seconds while also restoring spells from Resting. Regardless of Spell Casting Speed, 17 ticks of restoration will always be acquired. Points recharged per second increase when Memory Capacity increases, and meditative state duration and 1.5s recharge interval is affected by Spell Casting Speed.",
    "cooldown": "45s",
    "class": "wizard"
  },
  {
    "name": "Divine Protection",
    "icon": "Skill Divine Protection.png",
    "description": "Receive the blessing of the divine and increase Physical Damage Reduction by an additional flat +50% for 4 seconds.",
    "cooldown": "45s",
    "class": "cleric"
  },
  {
    "name": "Holy Purification",
    "icon": "Skill Holy Purification.png",
    "description": "Inflicts 100 base Divine Magical Damage to all undead Monsters within 7.5 meters.",
    "cooldown": "45s",
    "class": "cleric"
  },
  {
    "name": "Judgement",
    "icon": "Skill Judgement.png",
    "description": "After channeling for 0.75 seconds, instantly deals 25 Divine Magical Damage to a target and decreases their Movement Speed Bonus by -30% for 2 seconds. The spell can only be cast when the crosshair targets an enemy within 5m. Once Judgement starts casting on a target you will no longer need to continue targeting the crosshair. If the target goes out of range during casting, the casting fails and the skill enters cooldown.",
    "cooldown": "28s",
    "class": "cleric"
  },
  {
    "name": "Smite",
    "icon": "Skill Smite.png",
    "description": "When activated, your attacks deal an additional instance of 10 Divine Magical Damage for 7 seconds.",
    "cooldown": "18s",
    "class": "cleric"
  },
  {
    "name": "Dissonance",
    "icon": "Skill Dissonance.png",
    "description": "Creates an unpleasant noise to block hostile targets within a certain area from casting spells and silence them for 3 seconds. May act similarly to Rogue's Cut Throat.",
    "cooldown": "30s",
    "class": "bard"
  },
  {
    "name": "Encore",
    "icon": "Skill Encore.png",
    "description": "The next song is automatically played to the end without any input and is sure to succeed. Additionally, the song is played at the maximum 50% play speed regardless of the Bard's Dexterity.",
    "cooldown": "4s",
    "class": "bard"
  },
  {
    "name": "Music Memory",
    "icon": "Skill Music Memory.png",
    "description": "Can store up to 5 sheet music as space permits.",
    "cooldown": "/",
    "class": "bard"
  },
  {
    "name": "Music Memory 2",
    "icon": "Skill Music Memory.png",
    "description": "Can store up to 5 sheet music as space permits.",
    "cooldown": "/",
    "class": "bard"
  },
  {
    "name": "Party Maker",
    "icon": "Skill Partymaker.png",
    "description": "Remove drunk effect from all allies.",
    "cooldown": "25s",
    "class": "bard"
  },
  {
    "name": "Blow of Corruption",
    "icon": "Skill Blow of Corruption.png",
    "description": "The next melee physical attack deals a separate instance of 10 Evil Magical Damage to the target and reduces outgoing healing performed by them by 80% for 12 seconds. If no attack is successful, Blow of Corruption will only remain active for 8 seconds before deactivating and entering cooldown. (Damage scales with 100% of Magical Damage) If an attack is blocked by a shield, it will consume the skill buff without dealing damage. If the weapon is blocked at the hilt, no damage will be dealt but the buff will not be consumed.",
    "cooldown": "24s",
    "class": "warlock"
  },
  {
    "name": "Dark Offering",
    "icon": "Skill Dark Offering.png",
    "description": "Sacrifices 10% of Max Health for 5% Physical and Magic Power Bonus over 15 seconds.",
    "cooldown": "60s",
    "class": "warlock"
  },
  {
    "name": "Phantomize",
    "icon": "Skill Phantomize.png",
    "description": "For 6 seconds become untargetable, phasing through melee attacks, projectiles, and hitcan Magic (Zap, Lesser Heal, etc.). During this period you can only move and do not collide with other players or monsters, but are still vulnerable to AoE damage. During this state, Move Speed Bonus increases by 10%, and Magic Damage Reduction is reduced by a flat -50%.",
    "cooldown": "28s",
    "class": "warlock"
  },
  {
    "name": "Blood Pact",
    "icon": "Skill Blood Pact.png",
    "description": "Assimilates the contracted demon after casting for 1s, gaining an additional 50 Temporary Max Health, 50 Armor Rating, and 50 Magic Resistance. Your entire body is covered in Abyssal Flame, sacrificing 1% of Max Health per second and dealing 2 Magical Damage per second to nearby enemies. Duration ends when Blood Pact is re-casted. Additionally, by consuming Darkness Shards, you gain +1 All Attributes effects for each Darkness Shard consumed. When you become a demon your other skill is replaced with Exploitation Strike and you cannot equip weapons. Instead, Left-Click: Bare handed attack that deals 10 physical damage x 200% Combo damage on every hit and slows the target by 20% for 1s. Slowed by 20% while attacking. Perform up to 4 combo attacks using both hands. Right-Click: Fire a bolt of darkness. (costs 3hp)",
    "cooldown": "2s",
    "class": "warlock"
  },
  {
    "name": "Exploitation Strike",
    "icon": "Skill Exploitation Strike.png",
    "description": "When using Blood Pact, this skill replaces the other equipped skill. Cannot be used outside of Blood Pact. Deal an additional 4 Magical Damage to all enemies hit with a physical attack within 4 seconds and heal the caster by 5% of the target's Max Health.",
    "cooldown": "28s",
    "class": "warlock"
  }
]
